{
	"entries": [
		{
			"item": "minecraft:campfire",
			"text": "Unlit kindling for a pleasantly hot bonfire. You can light it using a fire striker. Standing in close proximity of a lit campfire will grant the Comfort effect."
		},
		{
			"item": "minecraft:soul_campfire",
			"component": [
				{
					"text": "Unlit kindling for a fire so cold* that it burns. You can light it using a fire striker. Standing in close proximity of a lit campfire will grant the Comfort effect."
				},
				{
					"text": " "
				},
				{
					"text": "*Soul fire isn't actually cold."
				}
			]
		},
		{
			"item": ["minecraft:campfire", "minecraft:soul_campfire"],
			"text": "Campfires can also burn tree bark into charcoal lumps, which can be crafted into charcoal if you're having no luck finding coal."
		},
		{
			"item": "#minecraft:beds",
			"text": "A warm, cozy bed to sleep your troubles away. Sets your spawn point when right-clicked."
		},
		{
			"item": "#upgrade_aquatic:bedrolls",
			"text": "A makeshift bed for much needed rest during long expeditions or in the earlier days of a world. Does not set your spawn point."
		},
		{
			"item": ["#minecraft:beds", "#upgrade_aquatic:bedrolls"],
			"component": [
				{
					"text": "Sleeping will ",
					"extra": [
						{
							"text": "not skip the night instantly,",
							"bold": true
						},
						{
							"text": " but rather accelerate the passage of time until it's day. While this means sleeping takes much longer, it'll also "
						},
						{
							"text": "accelerate things like the growth of your crops and the processing of your furnaces!",
							"bold": true
						}
					]
				}
			]
		},
		{
			"item": ["kubejs:bone_knife", "kubejs:copper_knife", "kubejs:rose_gold_knife", "alloyed:steel_knife", "oreganized:electrum_knife", "kubejs:lead_knife"],
			"text": "Knives are lightweight melee weapons. They can harvest Straw from grasses, and guarentee secondary drops from animals. They will also occasionally cause certain mobs to drop their heads."
		},
		{
			"item": "#forge:tools/hoes",
			"text": "Hoes will allow you to obtain seeds from various foliage such as grass or sandy shrubs, as they normally won't yield any without the use of a hoe. They can also rake through leaves quicker than other tools."
		},
		{
			"item": "#forge:tools/gold",
			"text": ["Golden tools are fragile, but harvest blocks the quickest out of every tool and increase drops from certain blocks like ores, and from mobs.", "(Note: Golden pickaxes can harvest any block iron pickaxes can.)"]
		},
		{
			"item": ["minecraft:leather_helmet","minecraft:leather_chestplate","minecraft:leather_leggings","minecraft:leather_boots"],
			"text": "Leather armour will lightly reduce fall damage."
		},
		{
			"item": ["minecraft:chainmail_helmet","minecraft:chainmail_chestplate","minecraft:chainmail_leggings","minecraft:chainmail_boots"],
			"text": "Chainmail armour is now craftable and will cause attackers to take damage when they come in contact with the wearer."
		},
		{
			"item": ["minecraft:golden_helmet","minecraft:golden_chestplate","minecraft:golden_leggings","minecraft:golden_boots"],
			"text": "Golden armour is fragile, but will lightly protect the wearer against fire damage."
		},
		{
			"item": ["alloyed:steel_pickaxe","alloyed:steel_shovel","alloyed:steel_hoe","alloyed:steel_axe","alloyed:steel_sword","alloyed:steel_knife"],
			"text": "Steel tools are slow and heavy, but highly durable. Steel swords, axes and knives will knock targets further away."
		},
		{
			"item": ["alloyed:steel_helmet","alloyed:steel_chestplate","alloyed:steel_leggings","alloyed:steel_boots"],
			"text": "Steel armour will lightly protect the wearer against projectile damage and getting knocked back."
		},
		{
			"item": ["additionaladditions:rose_gold_helmet","additionaladditions:rose_gold_chestplate","additionaladditions:rose_gold_leggings","additionaladditions:rose_gold_boots"],
			"text": "Rose gold armour will lightly protect the wearer against magic damage."
		},
		{
			"item": ["additionaladditions:rose_gold_shovel","additionaladditions:rose_gold_pickaxe","additionaladditions:rose_gold_axe","additionaladditions:rose_gold_hoe","additionaladditions:rose_gold_sword","kubejs:rose_gold_knife"],
			"text": ["Rose gold tools are quick, with a delicate touch - most blocks harvested with rose gold tools will drop themselves as they are, in place of what they would normally drop.", "Ores, glass, leaves, you name it - they'll all drop in block form. Rose gold tools may seem weak, but they deal bonus magic damage to targets, piercing through any armour they may have!"]
		},
		{
			"item": ["minecraft:netherite_pickaxe","minecraft:netherite_shovel","minecraft:netherite_hoe","minecraft:netherite_axe","minecraft:netherite_sword","farmersdelight:netherite_knife"],
			"text": "Netherite tools are extremely durable and won't burn up when thrown into fire or lava in item form. Netherite swords, axes and knives will set targets on fire."
		},
		{
			"item": ["minecraft:netherite_helmet","minecraft:netherite_chestplate","minecraft:netherite_leggings","minecraft:netherite_boots"],
			"text": "Netherite armour will protect the wearer against a decent amount of fire damage and provide light knockback resistance - additionally, it won't burn up when thrown into fire or lava in item form."
		},
		{
			"item": ["oreganized:electrum_pickaxe","oreganized:electrum_shovel","oreganized:electrum_hoe","oreganized:electrum_axe","oreganized:electrum_sword","oreganized:electrum_knife"],
			"text": "Electrum tools harvest blocks very quickly. Electrum swords, axes and knives will deal slightly increased damage to undead mobs."
		},
		{
			"item": ["oreganized:electrum_helmet","oreganized:electrum_chestplate","oreganized:electrum_leggings","oreganized:electrum_boots"],
			"text": "Electrum armour will increase the wearer's movement speed."
		},
		{
			"item": "minecraft:shears",
			"component": [
				{
					"text": "A pair of copper shears. Shears will allow you to gather wool from sheep, as they ",
					"extra": [
						{
							"text": "won't yield any when killed.",
							"bold": true
						}
					]
				}
			]
		},
		{
			"item": "minecraft:shears",
			"component": [
				{
					"text": "If this is a pair of shears, what's two of them next to each other called?"
				},
				{
					"text": "Well, two pairs of shears - ",
					"extra": [
						{
							"text": "obviously.",
							"italic": true
						}
					]
				}
			]
		},
		{
			"item": "ecologics:crab_claw",
			"component": [
				{
					"text": "Believe it or not, this claw is basically an edible pair of shears. Shears will allow you to gather wool from sheep, as they ",
					"extra": [
						{
							"text": "won't yield any when killed.",
							"bold": true
						}
					]
				}
			]
		},
		{
			"item": ["#farmersrespite:tea_leaves","farmersrespite:wild_tea_bush","farmersrespite:tea_seeds"],
			"text": "Tea is rarely found in swamps. It's a unique crop in that harvesting it in different stages of its growth will yield different coloured tea leaves. The first stage will yield green tea leaves, the second will yield yellow tea leaves, the third will yield both yellow and black tea leaves and the final stage will yield black tea leaves."
		},
		{
			"item": ["farmersrespite:coffee_beans","farmersrespite:coffee_berries","farmersrespite:wild_coffee_bush"],
			"text": "Coffee is found in basalt deltas in the Nether. When planted in the overworld, coffee needs regular crops around it to grow and will cause those crops to wither away. It will grow normally if planted in the Nether. Since you can't sleep in the Nether, at least the caffeine will keep you awake."
		},
		{
			"item": ["minecraft:wheat_seeds","minecraft:wheat"],
			"text": "Wheat is grown with wheat seeds, which are most commonly found by mowing through any kind of grass using a hoe."
		},
		{
			"item": ["minecraft:pumpkin_seeds","minecraft:pumpkin","minecraft:carved_pumpkin","farmersdelight:pumpkin_slice","autumnity:large_pumpkin_slice","autumnity:carved_large_pumpkin_slice"],
			"text": "Pumpkins can be found in most grassy biomes, typically in grouped patches. You'll need a Knife to cut them up into slices. You can also carve them with any type of shears."
		},
		{
			"item": ["minecraft:melon_seeds","minecraft:melon","minecraft:melon_slice","overweight_farming:seedless_peeled_melon","overweight_farming:half_seeded_peeled_melon","overweight_farming:seeded_peeled_melon"],
			"text": "Melons can be found in jungles. You'll need a Knife to cut them up into slices."
		},
		{
			"item": ["minecraft:beetroot_seeds","farmersdelight:sandy_shrub"],
			"text": ["Beetroot can be commonly found as a wild plant in beach coasts."]
		},
		{
			"item": ["farmersdelight:tomato_seeds"],
			"text": "Tomatoes can be commonly found as a wild plant in arid lands, such as savannas and deserts."
		},
		{
			"item": ["farmersdelight:cabbage_seeds"],
			"text": "Cabbages can be commonly found as a wild plant in beach coasts."
		},
		{
			"item": ["farmersdelight:rice","farmersdelight:wild_rice","farmersdelight:rice_panicle"],
			"text": "After it's grown, it will drop a rice panicle when harvested normally, which you'll have to cut up - but if harvested with a knife, it'll drop the rice directly!"
		},
		{
			"item": ["minecraft:sweet_berries","berry_good:sweet_berry_pips"],
			"text": "Sweet berries are most commonly found growing in taigas. Foxes love them."
		},
		{
			"item": ["minecraft:glow_berries","berry_good:glow_berry_pips"],
			"component": [
				{
					"text": "Glow berries are found underground in lush caves. They quell your hunger ",
					"extra": [
						{
							"text": "and",
							"italic": true
						},
						{
							"text": " the darkness!"
						}
					]
				}
			]
		},
		{
			"item": ["autumnity:foul_berries","autumnity:foul_berry_pips"],
			"text": "Foul berries can be found growing in maple forests. They'll give you the Foul Taste effect, which will make the next food you eat more saturating while the effect is active. Turkeys love them... for some reason."
		},
		{
			"item": ["neapolitan:strawberries","neapolitan:white_strawberries","neapolitan:strawberry_pips"],
			"text": "Strawberries are found in patches around plains biomes. Strawberries, along with all foods that have strawberries in them, restore a little bit of your health when eaten. Growing strawberry bushes at altitudes above 256 blocks will yield white strawberries."
		},
		{
			"item": ["neapolitan:mint_leaves","neapolitan:mint_sprout"],
			"text": "Mint is typically found on windswept hills and some other cold biomes. Mint, along with most foods that have mint in them, give you the Berserking effect."
		},
		{
			"item": ["neapolitan:banana","neapolitan:banana_bunch","neapolitan:banana_bundle","neapolitan:banana_stalk","neapolitan:small_banana_frond","neapolitan:banana_frond","neapolitan:large_banana_frond"],
			"text": "Bananas are found on beaches hanging off of thick banana stalks with fronds on them. Bananas, along with all foods that have bananas in them, give you the Agility effect. I hear someone named after a certain kind of bread roll really likes them."
		},
		{
			"item": "neapolitan:vanilla_pods",
			"text": "Vanilla is found in savanna biomes. You might wanna use some shears when harvesting it. Vanilla pods, along with all foods that have vanilla in them, give you the Vanilla Scent effect."
		},
		{
			"item": ["supplementaries:flax","supplementaries:flax_seeds"],
			"text": "Flax can be found in the wild in most biomes, and is used to make things like sacks, doormats and rope - it can also be cut, milled or crushed into string."
		},
		{
			"item": ["culturaldelights:eggplant_seeds","culturaldelights:eggplant","culturaldelights:wild_eggplants"],
			"text": "Eggplants are found somewhat sparsely in jungles. They're by far the beefiest out of all the regular crops."
		},
		{
			"item": ["culturaldelights:corn_kernels","culturaldelights:corn_cob","culturaldelights:wild_corn"],
			"text": "Corn can be found scattered around in all plains-like biomes."
		},
		{
			"item": ["culturaldelights:avocado","culturaldelights:avocado_pit","culturaldelights:avocado_sapling"],
			"text": "Avocados can be found growing on avocado trees in jungles. You can also grow avocado trees yourself by obtaining avocado saplings or avocado pits."
		},
		{
			"item": ["culturaldelights:avocado","culturaldelights:avocado_pit","culturaldelights:avocado_sapling"],
			"component": [
				{
					"text": "Avocado avocado avocado. Doesn't sound like a word anymore, does it?"
				},
				{
					"text": "That's called ",
					"extra": [
						{
							"text": "jamais vu.",
							"italic": true
						}
					]
				}
			]
		},
		{
			"item": ["nethersdelight:propelpearl","nethersdelight:propelplant_cane"],
			"text": "Propelpearls grow on propelplant canes in the Nether, typically in Nether wastes or crimson forests. Try to harvest the canes without a knife or simply walk into them and you'll be in for an explosive surprise! Propelpearls will also set you on fire if eaten raw, so you might wanna cook them together with something to quell said fire. The canes on the other hand can either be crushed or ground into gunpowder."
		},
		{
			"item": ["environmental:truffle","environmental:buried_truffle"],
			"text": "After feeding a pig a golden carrot, it will lead you to some buried truffles, which you can dig to obtain... well, truffles. Truffles, along with foods made with them, will grant you the Health Boost effect, temporarily increasing your maximum health."
		},
		{
			"item": ["#minecraft:coal_ores","minecraft:coal","minecraft:coal_block","spelunkery:coal_lump"],
			"text": "Coal can be found commonly on high altitudes and is a cheap yet efficient fuel source. It's even more efficient if you pack it into a block... somehow?"
		},
		{
			"item": ["#minecraft:iron_ores","minecraft:raw_iron","minecraft:raw_iron_block","minecraft:iron_ingot","minecraft:iron_block","spelunkery:raw_iron_nugget","minecraft:iron_nugget"],
			"text": "Iron can be found near - but not directly at - deepslate level and is an extremely versatile material most commonly used to make reliably powerful tools, armour and various other helpful items."
		},
		{
			"item": ["#minecraft:copper_ores","minecraft:raw_copper","minecraft:raw_copper_block","minecraft:copper_ingot","copperandtuffbackport:chiseled_copper","copperandtuffbackport:waxed_chiseled_copper","spelunkery:raw_copper_nugget","create:copper_nugget"],
			"text": ["Copper can be found very commonly both over and underground, though it's less common in lower altitudes.", "It's used to make copper tools and shears early on, and other unique gadgets later in the game."]
		},
		{
			"item": ["#minecraft:copper_ores","minecraft:raw_copper","minecraft:raw_copper_block","minecraft:copper_ingot","copperandtuffbackport:chiseled_copper","copperandtuffbackport:waxed_chiseled_copper","spelunkery:raw_copper_nugget","create:copper_nugget"],
			"text": ["It can also be used to make decorative blocks that oxidise over time, which can be prevented by waxing them with honeycombs.", "Together with gold, copper makes rose gold alloy, which can be used to upgrade iron equipment."]
		},
		{
			"item": ["#minecraft:gold_ores","minecraft:gilded_blackstone","minecraft:raw_gold","minecraft:raw_gold_block","minecraft:gold_ingot","minecraft:gold_block","spelunkery:raw_gold_nugget","minecraft:gold_nugget"],
			"text": "Gold is most commonly found near the top of the deepslate layer and is also found in the Nether. It has some magical properties and is used in making rose gold, electrum and netherite. You can also use gold ingots to barter for various items with Piglins."
		},
		{
			"item": ["#minecraft:redstone_ores","spelunkery:rough_cinnabar","spelunkery:cinnabar","spelunkery:rough_cinnabar_block","spelunkery:cinnabar_block","spelunkery:rough_cinnabar_shard","spelunkery:cinnabar_shard","minecraft:redstone","minecraft:redstone_block"],
			"text": "Cinnabar is found near the lower half of the world and can be seen more frequently as you go further and further down. Rough cinnabar can be polished via sand paper or on a grindstone and then crushed to obtain redstone dust, a conductive powder that can be placed to form lines and make all sorts of machines and contraptions."
		},
		{
			"item": ["#minecraft:diamond_ores","spelunkery:rough_diamond","spelunkery:rough_diamond_block","minecraft:diamond","minecraft:diamond_block","spelunkery:rough_diamond_shard","spelunkery:diamond_shard"],
			"text": "Diamonds are most common near the very bottom of the world. They're precious gemstones used to forge some of the toughest tools and armour in the game."
		},
		{
			"item": "minecraft:ancient_debris",
			"text": "Ancient debris is found in small chunks near the bottom of the Nether. It's said that the Piglins have long since mined up all of whatever ore it was left from, but it could potentially still be forged into something powerful..."
		},
		{
			"item": ["minecraft:netherite_scrap","minecraft:netherite_ingot","caverns_and_chasms:netherite_nugget","minecraft:netherite_block"],
			"text": "Netherite is an extraordinarily powerful metal made from alloying ancient scraps together with gold. It's used to make the strongest, most durable tools and armour in the game. Netherite and tools/armour made with it are impervious to fire and lava. Piglin brutes also often drop ancient scraps."
		},
		{
			"item": ["#forge:ores/zinc","create:raw_zinc","create:raw_zinc_block","create:zinc_ingot","create:zinc_block","spelunkery:raw_zinc_nugget","create:zinc_nugget"],
			"text": "Zinc is found scattered around at pretty much any altitude underground and is used to make various alloys such as sturdy alloy, bronze and brass. Zinc can also be used to make Copycat Steps and Panels to add extra depth to builds."
		},
		{
			"item": ["#forge:ores/lead","oreganized:raw_lead","oreganized:raw_lead_block","oreganized:lead_ingot","oreganized:lead_block","spelunkery:raw_lead_nugget","oreganized:lead_nugget"],
			"text": "Lead is found somewhat frequently deep underground and in Nether wastes, but it can be found much higher up near the surface in savanna biomes. It's used to make tools, depth gauges, minecarts & rails, crystal glass, bombs, and as a cheaper iron alternative in certain recipes."
		},
		{
			"item": ["#forge:ores/silver","oreganized:raw_silver","oreganized:raw_silver_block","oreganized:silver_ingot","oreganized:silver_block","spelunkery:raw_silver_nugget","oreganized:silver_nugget"],
			"text": "Silver is found very rarely right between the stone and deepslate layers underground. It's used to make silver mirrors, exposers, and alloyed with gold to make electrum, a metal used in forging the fastest and second most durable tools/armour."
		},
		{
			"item": ["oreganized:electrum_ingot","oreganized:electrum_nugget","oreganized:electrum_block"],
			"text": "Electrum is a very powerful metal made from silver and gold. It's used to make some of the most durable tools/armour and can even be preferable over netherite in that the tools are slightly quicker and the armour will increase your movement speed."
		},
		{
			"item": ["alloyed:steel_ingot","alloyed:steel_nugget","alloyed:steel_block"],
			"text": "Steel is a tough metal made by alloying iron or lead with fire charges. It's used to upgrade lead tools or chainmail armour and in making some important components for certain contraptions. Steel equipment is heavy and slow, but very durable."
		},
		{
			"item": ["alloyed:bronze_ingot","alloyed:bronze_nugget","alloyed:bronze_block"],
			"text": "Bronze is made by alloying copper with zinc and cinder flour. It has some musical properties and can be used to make some oxidizing building blocks similar to copper."
		},
		{
			"item": ["create:brass_ingot","create:brass_nugget","create:brass_block"],
			"text": "Brass is made by alloying copper with zinc. It's used in making various mechanical components such as smart chutes and fluid pipes, pulse repeaters and extenders, mechanical arms, inventory cables, bigger funnels and tunnels, etc."
		},
		{
			"item": ["oreganized:silver_ore", "#forge:ores_in_ground/deepslate"],
			"text": "Deepslate ores yield extra drops and are blast resistant. Both stone and deepslate silver ores are blast resistant."
		},
		{
			"item": ["spelunkery:magnetite", "spelunkery:magnetite_chunk", "spelunkery:raw_magnetite_nugget"],
			"text": "Magnetite can be found near large iron veins deep underground. Deepslate iron ore will occasionally drop magnetite nuggets, and small magnetite geodes covered with obsidian will spawn around the Nether."
		},
		{
			"item": ["spelunkery:magnetite", "spelunkery:magnetite_chunk", "spelunkery:raw_magnetite_nugget"],
			"text": "Using a magnetic compass will make finding magnetite much easier."
		},
		{
			"item": ["upgrade_aquatic:blue_pickerelweed","upgrade_aquatic:purple_pickerelweed","upgrade_aquatic:boiled_blue_pickerelweed","upgrade_aquatic:boiled_purple_pickerelweed","upgrade_aquatic:blue_pickerelweed_block","upgrade_aquatic:purple_pickerelweed_block","upgrade_aquatic:boiled_blue_pickerelweed_block","upgrade_aquatic:boiled_purple_pickerelweed_block"],
			"text": "Both types of pickerelweed are found near rivers. When cooked and then eaten underwater, they'll restore your air supply."
		},
		{
			"item": "minecraft:compass",
			"text": "Compasses point towards your last set spawn point. If used on a lodestone, they will point towards the specific lodestone to which they were assigned. Right clicking with a compass in hand will briefly display your latitude and longitude."
		},
		{
			"item": "minecraft:recovery_compass",
			"text": "Recovery compasses point towards your last death point. Keep one at your base so you never lose track of your lost items!"
		},
		{
			"item": "spelunkery:magnetic_compass",
			"text": "Magnetic compasses always point towards north, unless there's magnetic interference being caused by any raw magnetite in a 128 block radius, in which case they start glowing and pointing towards that magnetite chunk. Right clicking with a magnetic compass in hand will briefly display your latitude and longitude, however if there's magnetic interference, it will display the coordinates of the interference's source instead."
		},
		{
			"item": "minecraft:clock",
			"text": "Clocks show the time of day. Right clicking with a clock in hand will briefly display the time of day in numerical form and the day number."
		},
		{
			"item": "minecraft:spyglass",
			"text": "Spyglasses allow you to zoom your view towards wherever you're looking. Using the scroll wheel will allow you to adjust the zoom amount. When zooming in on a block or entity, its name and/or stats will be displayed in the upper left corner of the screen."
		},
		{
			"item": "minecraft:spyglass",
			"text": "Through the use of a keybind (Z by default), you can instantly use your spyglass from anywhere inside your inventory."
		},
		{
			"item": "caverns_and_chasms:depth_gauge",
			"text": "Depth gauges show your current altitude. Right clicking with a depth gauge in hand will briefly display your altitude."
		},
		{
			"item": "map_atlases:atlas",
			"text": "Atlases allow you to easily map out your surroundings. Putting an atlas and empty maps together in a crafting table or a cartography table will put the maps inside the atlas, ready to be used."
		},
		{
			"item": "map_atlases:atlas",
			"text": "When you have an atlas in your hotbar, it'll display a minimap in the corner (upper right by default) of your screen."
		},
		{
			"item": ["farmersdelight:roast_chicken_block","farmersdelight:stuffed_pumpkin_block","farmersdelight:honey_glazed_ham_block","farmersdelight:shepherds_pie_block","farmersdelight:rice_roll_medley_block","culturaldelights:exotic_roll_medley","nethersdelight:stuffed_hoglin","brewinandchewin:fiery_fondue_pot","kubejs:eggplant_parmesan_block","miners_delight:stuffed_squid"],
			"text": "These foods are all feasts - meaning, you can place them down and then take portions out of them, typically with bowls."
		},
		{
			"item": "farmersdelight:organic_compost",
			"text": "Organic compost can be made out of a variety of waste material, or can occasionally be obtained from a full composter."
		},
		{
			"item": ["farmersdelight:organic_compost","farmersdelight:rich_soil"],
			"text": "By placing down some organic compost and letting it sit for a while, you'll be able to get your hands on rich soil, which doesn't require water to grow crops, but grows crops faster than normal if water is provided."
		},
		{
			"item": ["farmersdelight:organic_compost","farmersdelight:rich_soil"],
			"text": "If you're having trouble remembering or figuring out which crops rich soil allows to grow faster, just remember - if it bone meals, it rich soils!"
		},
		{
			"item": "#minecraft:creeper_drop_music_discs",
			"text": "Dropped by a creeper when killed by a skeleton."
		},
		{
			"item": ["minecraft:music_disc_13","minecraft:music_disc_cat"],
			"text": "These two discs can also be found in dungeon chests."
		},
		{
			"item": "minecraft:music_disc_pigstep",
			"text": "Found in the Nether inside piglin bastion remnants."
		},
		{
			"item": "berry_good:music_disc_fox",
			"text": "Foxes can very rarely be found holding this disc in their mouths."
		},
		{
			"item": "ecologics:music_disc_coconut",
			"text": "Found in buried treasure chests."
		},
		{
			"item": "environmental:music_disc_slabrave",
			"text": "Can be obtained by feeding any of the discs that drop from creepers to a slabfish."
		},
		{
			"item": "neapolitan:music_disc_hullabaloo",
			"text": "Can be obtained by getting a group of chimpanzees to kill a ravager by shooting it with a bananarrow."
		},
		{
			"item": "kubejs:music_disc_death",
			"text": "Dropped by a chicken, duck or turkey when killed by a skeleton."
		},
		{
			"item": "kubejs:music_disc_droopy1",
			"text": "Has a very small chance to be dropped by mobs that can drop their heads, or can alternatively be made by crafting one of said heads together with disc fragments."
		},
		{
			"item": "minecraft:rabbit_hide",
			"text": "Leather scraps can be obtained by cutting leather on a cutting board using shears or dealing the killing blow on various livestock with a knife. As they're used in the same recipes as regular leather, they'll allow you to save a bunch of leather!"
		},
		{
			"item": "minecraft:rabbit_hide",
			"text": "You can also salvage some leather scraps from various leather equipment thanks to the cutting board."
		},
		{
			"item": ["#create:sandpaper", "spelunkery:rough_cinnabar", "spelunkery:rough_cinnabar_shard", "spelunkery:rough_diamond", "spelunkery:rough_diamond_shard", "create:rose_quartz"],
			"text": "Sand paper will allow you to polish rough gems. If you're finding the process too slow, use a grindstone or hand the sand paper to a deployer!"
		},
		{
			"item": ["minecraft:grindstone", "spelunkery:rough_cinnabar", "spelunkery:rough_cinnabar_shard", "spelunkery:rough_cinnabar_block", "spelunkery:rough_diamond", "spelunkery:rough_diamond_shard", "spelunkery:rough_diamond_block"],
			"text": "Grindstones can repair and disenchant tools or armour, and directly right-clicking on one with a rough gem in hand will polish the gem. Grindstones can also polish whole rough gem blocks."
		},
		{
			"item": "spelunkery:item_magnet",
			"text": "When activated with a right-click, an item magnet will attract all items nearby towards you."
		},
		{
			"item": "spelunkery:echo_fork",
			"text": "Echo forks will temporarily add a glowing outline to mobs around you in a large radius, allowing them to be seen through walls."
		},
		{
			"item": "quark:trowel",
			"text": "Trowels will select and place a random block from your hotbar with every use. Perfect for adding some variation to your builds!"
		},
		{
			"item": "quark:echorang",
			"text": "When thrown, echorangs will fly far away, only stopping and flying back after reaching their maximum distance, hitting a block, or a mob. Hitting a block with a thrown echorang will destroy the block and the echorang will bring its drops to you."
		},
		{
			"item": "quark:echorang",
			"text": "Killing a mob with a thrown echorang will have it bring the mob's drops with it as it flies back to you. They'll also continue flying further when they fly near sculk shriekers."
		},
		{
			"item": "oreganized:silver_mirror",
			"text": "Silver mirrors will glow whenever an undead mob is nearby, and will deal huge damage to undead mobs specifically."
		},
		{
			"item": "minecraft:anvil",
			"text": "Anvils allow you to repair equipment using materials. They'll also let you rename items and combine enchantments."
		},
		{
			"item": "savage_and_ravage:wand_of_freezing",
			"text": "The Wand of Freezing is one of three ancient relics. It summons damaging and freezing ice blocks above your foes. It can be rarely found in fortresses of the undead, which are dungeons full of skeletons."
		},
		{
			"item": "savage_and_ravage:mask_of_dishonesty",
			"text": "The Mask of Dishonesty is one of three ancient relics. When worn and sneaking, it will allow you to go fully invisible to mobs and players, even if you're wearing armour or holding an item. It can be rarely found in desert pyramids."
		},
		{
			"item": "savage_and_ravage:conch_of_conjuring",
			"text": "The Conch of Conjuring is one of three ancient relics. It summons vicious fangs that come out of the ground and deal damage in a straight line in front of you. It can be rarely found in jungle temples."
		},
		{
			"item": "fishermens_trap:fishtrap",
			"component": [
				{
					"text": "Fish traps - ",
					"extra": [
						{
							"text": "when submerged deep underwater in river biomes",
							"bold": true
						},
						{
							"text": " - can automatically catch fish based on the bait placed inside. If they have no bait, they'll catch other miscellaneous items instead."
						}
					]
				}
			]
		},
		{
			"item": "minecraft:heart_of_the_sea",
			"text": "Hearts of the sea are ancient artifacts found rarely in buried treasure chests. A heart of the sea, along with some nautilus shells, can be used to craft a conduit."
		},
		{
			"item": "minecraft:composter",
			"text": ["Composters will allow you to recycle various biological material into some bone meal, or even occasionally some organic compost.", "This process can be automated by placing a hopper on top of and under the composter."]
		},
		{
			"item": "minecraft:ender_eye",
			"text": "Awoken exopearls are not only a useful crafting ingredient, but will also fly in the direction of the nearest ruined Nether portal structure when used."
		},
		{
			"item": "heartstone:heartstone",
			"text": "Binding exopearls come in pairs and will allow you to easily locate and/or keep track of another player. Simply hand someone one of the two binding exopearls and this will bind you and them together, creating a particle trail leading towards each other whenever one of you two right-clicks with the item in hand."
		}
	]
}